// migrations/009_update_files_date.js
import sqlite3 from 'sqlite3';
import path from 'path';
const sqlite = sqlite3.verbose();
const db = new sqlite.Database(path.resolve(__dirname, '../../memes.db'));
// const { readFileSync, writeFileSync } = require("fs");

// / Миграция: добавление персональных данных пользователей
db.serialize(async () => {
    try {
        // await clear();
        for (const item of getData()) {
            await run(item);
        }
    } catch (error) {
        console.error(error);
    } finally {
        closeDatabase();
    }
});

function run(item: { date: string; file: string }) {
    const query = `UPDATE memes SET created_at = '${item.date}' WHERE fileName = '${item.file}';`;
    return new Promise((resolve, reject) => {
        db.run(query, function (err) {
            if (!this.changes) {
                console.log(`No rows updated for file: ${item.file}`);
            }
            if (err) {
                reject('Ошибка при обновлении: ' + query + ' ' + err.message);
            } else {
                resolve(true);
            }
        });
    });
}

// @ts-ignore
function clear() {
    const query = `UPDATE memes SET created_at = NULL;`;
    return new Promise((resolve, reject) => {
        db.run(query, function (err) {
            if (err) {
                reject('Ошибка при обновлении: ' + query + ' ' + err.message);
            } else {
                resolve(true);
            }
        });
    });
}

function closeDatabase() {
    db.close((err) => {
        if (err) {
            console.error('Error closing database:', err.message);
        } else {
            console.log('Migration 009 completed successfully');
        }
    });
}

// Функция исправления битой кодировки
// function fixEncoding(str) {
//   return Buffer.from(str, "binary").toString("utf8");
// }

// const data = getData();
// const localData = getLocalData();

// const resultErrors = [];

// data.forEach((item) => {
//   if (item.date.startsWith("2025-07-27")) {
//     const filename = fixEncoding(item.file);
//     const localItem = localData.find((local) => filename.search(local.file) !== -1);
//     if (localItem) {
//       item.date = subtractHours(localItem.date, 5);
//     } else {
//       resultErrors.push(filename);
//       console.log(`No local item found for ${filename}`);
//     }
//   }
// });

// console.log("Errors:", resultErrors);
// writeFileSync('result.json', JSON.stringify(data, null, 2));

// function subtractHours(datetimeStr, hours) {
//   // Преобразуем строку в объект Date
//   // Заменяем пробел на 'T', чтобы JS корректно распознал ISO-формат
//   const date = new Date(datetimeStr.replace(' ', 'T'));

//   // Вычитаем указанное количество часов
//   date.setHours(date.getHours() - hours);

//   // Форматируем обратно в "YYYY-MM-DD HH:mm:ss"
//   const pad = n => String(n).padStart(2, '0');
//   const formatted =
//     `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())} ` +
//     `${pad(date.getHours())}:${pad(date.getMinutes())}:${pad(date.getSeconds())}`;

//   return formatted;
// }

function getData() {
    return [
        {
            date: '2024-10-21 08:46:13',
            file: '1753604740253-Ð¯ Ð¸ ÐµÑÑÑ ÑÐ¿Ð¸ÑÐ¾Ðº.jpg',
        },
        {
            date: '2024-08-29 07:14:37',
            file: '1753604823982-Ð©ÐµÐ´ÑÐ¸Ð½.png',
        },
        {
            date: '2024-10-23 07:47:30',
            file: '1753604917936-ÑÑÐ¾ ÑÐ°ÐºÐ¾Ðµ ÐºÐ°ÑÐ°Ð»Ð¾Ð³.png',
        },
        {
            date: '2025-03-17 11:14:00',
            file: '1753605674304-Ð¨Ð°Ð±ÐÑÐÐ².jpg',
        },
        {
            date: '2025-05-14 07:42:00',
            file: '1753612233945-ÑÑÐ¾ Ð¿Ð¾ Ð·Ð°Ð´Ð°ÑÐµ.jpg',
        },
        {
            date: '2024-04-16 11:40:09',
            file: '1753612254252-ÑÐµÐ»Ð¾Ð²ÐµÐº ÐºÐ¾Ð½Ð²ÐµÑÑÐ°ÑÐ¸Ñ.png',
        },
        {
            date: '2024-10-07 11:36:22',
            file: '1753612265179-ÑÐ²Ð°ÑÐ¸Ñ.jpg',
        },
        {
            date: '2025-01-13 07:32:10',
            file: '1753612279249-ÑÐ¸Ð»Ð¾ÑÐ¾Ñ.png',
        },
        {
            date: '2023-10-13 09:36:37',
            file: '1753612288820-ÑÑÐ¸ÑÑ ÐºÐ¾Ð³Ð´Ð° Ñ Ð¶Ð¸Ð².jpg',
        },
        {
            date: '2024-09-09 07:34:02',
            file: '1753612308556-Ð£ÑÐ°ÑÑÐ¾Ðºpng.png',
        },
        {
            date: '2024-10-30 11:35:16',
            file: '1753612331565-ÑÑÐ°ÑÑÐ¾Ðº.jpg',
        },
        {
            date: '2025-04-09 05:36:00',
            file: '1753612378850-ÑÑÑÐ°Ð».jpg',
        },
        {
            date: '2024-09-09 05:47:37',
            file: '1753612395029-Ñ Ð½Ð°Ñ ÑÐ°Ðº Ð½Ðµ Ð¿ÑÐ¸Ð½ÑÑÐ¾.png',
        },
        {
            date: '2025-01-10 04:44:15',
            file: '1753612404978-Ð¢ÑÐ¾Ð»Ð¸Ñ.jpg',
        },
        {
            date: '2025-05-19 11:43:17',
            file: '1753612412168-ÑÐµÑÑÑÐº.png',
        },
        {
            date: '2024-11-28 04:43:47',
            file: '1753612426843-ÑÐµÑÑÐ¸ÑÑÐµÐ¼.jpg',
        },
        {
            date: '2025-04-01 11:15:00',
            file: '1753612442485-ÑÐ°Ð¸Ð½Ñ ÑÐµÐ»Ð¾Ð²ÐµÑÐµÑÑÐ²Ð°.png',
        },
        {
            date: '2024-11-05 07:59:31',
            file: '1753612453160-ÑÑÐ¿ÐµÑÐ²Ð¸Ð´Ð¶ÐµÑ.jpg',
        },
        {
            date: '2024-02-13 12:44:05',
            file: '1753612462576-Ð¡Ð¾Ð¿Ð¾ÑÑÐ°Ð²Ð»ÐµÐ½Ð¸Ðµ ÐÐ»ÐµÐ½Ð°.jpg',
        },
        {
            date: '2024-02-13 12:43:59',
            file: '1753612472310-Ð¡Ð¾Ð¿Ð¾ÑÑÐ°Ð²Ð»ÐµÐ½Ð¸Ðµ ÐÐ»ÐµÐ½Ð° Ð² Ð¼Ð°ÑÐºÐµ.jpg',
        },
        {
            date: '2025-01-14 13:27:13',
            file: '1753612477177-Ð¡Ð¾Ð³Ð»Ð°ÑÐµÐ½Ð¸Ðµ.png',
        },
        {
            date: '2025-01-10 07:34:38',
            file: '1753612483629-ÑÐ»Ð¾Ð¼Ð°Ð» ÐºÐ°ÑÐ°Ð»Ð¾Ð³.jpg',
        },
        {
            date: '2024-10-23 11:06:00',
            file: '1753612526448-ÑÐ»Ð¸Ð².jpg',
        },
        {
            date: '2023-10-13 09:31:06',
            file: '1753612543706-Ð¡Ð²Ð¾Ð¹ ÐÑÑ.jpg',
        },
        {
            date: '2024-09-04 15:53:00',
            file: '1753612577665-Ð¡Ð_Ð¾Ð´Ð¾Ð±ÑÑÐµÑ.jpg',
        },
        {
            date: '2025-05-07 10:39:05',
            file: '1753612591778-Ð¡Ð°Ð±Ð¸ÑÐÑÐ´.png',
        },
        {
            date: '2025-05-13 07:50:06',
            file: '1753612614959-Ð¡Ð°Ð±Ð¸ÑÐÑÐ´2.jpg',
        },
        {
            date: '2025-01-14 13:15:05',
            file: '1753612620192-Ð¡Ð°Ð±Ð¸Ñ Ð¸ ÐÐÐÐÐ¡.png',
        },
        {
            date: '2025-02-05 13:18:38',
            file: '1753612630970-Ð¡Ð°Ð±Ð¸Ñ Ð² ÑÐµÐ¼Ð½Ð¾ÑÐµ.png',
        },
        {
            date: '2025-05-16 05:44:44',
            file: '1753612637277-ÑÑÐºÐ¸ÑÐ¸Ñ.png',
        },
        {
            date: '2024-09-30 05:50:21',
            file: '1753612642713-Ð Ð¾Ð³Ð°Ð½Ð¾Ð².jpg',
        },
        {
            date: '2024-10-21 10:29:12',
            file: '1753612653136-Ð ÐµÐºÑÑÑÐ¸Ñ.png',
        },
        {
            date: '2025-07-17 08:26:20',
            file: '1753612659886-ÑÐµÐºÑÑÐ¸Ñ vs ÐºÐ¾Ð½Ð²ÐµÑÐ°ÑÐ¸Ñ.jpg',
        },
        {
            date: '2025-05-06 03:49:00',
            file: '1753612690196-ÑÐµÐ²Ñ-Ð¼Ð°ÑÐ·Ð¾ÑÑÑ.jpg',
        },
        {
            date: '2025-05-16 11:49:05',
            file: '1753612697184-Ð Ð°Ð·Ð¾Ð±ÑÐ°Ð» 7100.png',
        },
        {
            date: '2025-03-24 10:22:44',
            file: '1753612703502-ÑÐ°Ð·ÐµÐ±Ð°Ð» Ð¼Ð°ÑÐ¸Ð½Ñ 2x.jpg',
        },
        {
            date: '2024-12-11 04:20:42',
            file: '1753612709610-ÐÑÑÐ°ÐºÐ¾Ð², ÑÐ°Ð±Ð¾ÑÐ°Ð¹.jpeg',
        },
        {
            date: '2025-07-27 08:56:04',
            file: '1753612715261-ÐÑÑÐ°ÐºÐ².png',
        },
        {
            date: '2024-10-29 05:42:48',
            file: '1753612721288-ÐÑÐ¾ÑÐ¾Ðº.png',
        },
        {
            date: '2025-01-10 10:18:10',
            file: '1753612728027-ÐÑÐ¾Ð¸Ð³ÑÐ°Ð».jpg',
        },
        {
            date: '2023-10-13 09:50:33',
            file: '1753612734397-Ð¿Ð¾ÑÐ°.jpg',
        },
        {
            date: '2024-04-08 10:46:39',
            file: '1753612742106-Ð¿Ð¾Ð½ÐµÐ´ÐµÐ»ÑÐ½Ð¸Ðº.png',
        },
        {
            date: '2025-01-15 08:02:41',
            file: '1753612750912-Ð¿Ð¾Ð»ÑÐºÐ°ÑÑÐ¾ÑÐºÐ°.png',
        },
        {
            date: '2025-03-14 07:47:13',
            file: '1753612757588-Ð¿Ð¾Ð¹Ð¼Ð°Ð¹ Ð¼ÐµÐ½Ñ ÐµÑÐ»Ð¸ ÑÐ¼Ð¾Ð¶ÐµÑÑ.png',
        },
        {
            date: '2025-07-24 11:10:00',
            file: '1753612785150-ÐÐ»Ð°Ð½ÐµÑÐ° Ð¾Ð±ÐµÐ·ÑÑÐ½.jpg',
        },
        {
            date: '2025-01-24 07:04:41',
            file: '1753612794487-Ð¿ÐµÑÑ.png',
        },
        {
            date: '2024-09-26 11:54:25',
            file: '1753612803519-ÐÐµÑÑ.jpg',
        },
        {
            date: '2025-05-30 07:36:01',
            file: '1753612809820-Ð¿ÐµÑÐµÑÐ¾ÑÐ¾Ð²Ð°Ð».png',
        },
        {
            date: '2024-07-25 08:36:45',
            file: '1753612816883-Ð¾Ð¿ÑÐ¸Ð¼Ð¸Ð·Ð°ÑÐ¸Ñ ÐºÐ°ÑÐ°Ð»Ð¾Ð³Ð°.png',
        },
        {
            date: '2024-07-25 07:55:20',
            file: '1753612823290-Ð¾Ð½Ð»Ð°Ð¹Ð½ Ð¸ Ð·Ð²Ð¾Ð½ÐºÐ¸.png',
        },
        {
            date: '2024-12-09 07:39:08',
            file: '1753612831781-ÐÐ±ÑÑÐ¶Ð´Ð°ÐµÐ¼.jpg',
        },
        {
            date: '2024-11-05 07:24:42',
            file: '1753612845279-Ð¾Ð±ÐµÑÐ°Ð» ÑÐ²Ð¾Ð»Ð¸ÑÑÑ.jpg',
        },
        {
            date: '2024-10-08 11:39:04',
            file: '1753612851643-Ð½Ñ Ð¶Ðµ Ð·Ð°Ð¿ÑÑÐºÐ°Ð¹ÑÑ.png',
        },
        {
            date: '2025-05-21 13:06:29',
            file: '1753612858394-ÐÐµ Ð¿Ð¾Ð¼ÐµÑÐ°ÑÑÑ.png',
        },
        {
            date: '2024-12-25 13:03:22',
            file: '1753612863538-ÐÐ°ÑÐ¸Ñ Ð¸ Ð¤Ð°Ð½Ð¸Ñ.png',
        },
        {
            date: '2024-12-25 12:13:31',
            file: '1753612869649-Ð½Ð°ÑÑÑÐ°ÐµÐ¼.jpg',
        },
        {
            date: '2024-10-29 09:51:40',
            file: '1753612875503-ÐÐ¾Ñ_Ð²ÑÐµÐ¼Ñ_Ð¿ÑÐ¸ÑÐ»Ð¾.jpg',
        },
        {
            date: '2025-01-31 05:43:18',
            file: '1753612882675-Ð¼ÐµÐ¼Ð¾.png',
        },
        {
            date: '2024-02-27 08:33:04',
            file: '1753612890739-ÐÐ°Ð¼Ð±ÐµÑÐ¾Ð² Ð¡ÐµÑÐ³ÐµÐ¹.jpg',
        },
        {
            date: '2024-08-27 08:29:11',
            file: '1753612896935-Ð»ÑÑÑÐ¸Ð¹ ÐÐÑÐ¸Ðº.png',
        },
        {
            date: '2025-01-30 06:22:35',
            file: '1753612904533-Ð»ÐµÐ³ÐµÐ½Ð´Ð°.png',
        },
        {
            date: '2023-10-13 09:50:23',
            file: '1753612909528-ÐºÑÐ¾ ÑÐ¾ÑÐµÑ ÑÑÐ°ÑÑ.jpg',
        },
        {
            date: '2025-03-18 12:52:00',
            file: '1753612968201-ÐºÑÐµÑÑÐ¾Ð½Ð¾ÑÐµÑ-ÐºÑÐ±Ð°Ð½Ð¾Ð¸Ð´.jpg',
        },
        {
            date: '2025-05-05 09:13:59',
            file: '1753612978065-ÐºÐ¾Ñ-Ð´Ð¸Ð¼Ð¾Ð½Ð°.png',
        },
        {
            date: '2025-01-19 12:38:00',
            file: '1753613007258-ÐºÐ¾Ð¿Ð°ÑÐµÐ»Ñ.jpg',
        },
        {
            date: '2024-04-16 11:40:09',
            file: '1753613015165-ÐºÐ¾Ð½Ð²ÐµÑÑÐ°ÑÐ¸Ñ.png',
        },
        {
            date: '2024-10-10 08:47:25',
            file: '1753613024781-ÐºÐ½Ð¾Ð¿ÐºÐ°.jpg',
        },
        {
            date: '2025-01-10 07:34:38',
            file: '1753613030613-ÐºÐ°ÑÐ°Ð»Ð¾Ð³.jpg',
        },
        {
            date: '2023-10-13 09:50:44',
            file: '1753613038309-ÐÐ°ÑÐ°Ð´Ð»Ð³ ÑÑÐ¾Ñ ÐµÐ±ÑÑÐ¸Ð¹.jpg',
        },
        {
            date: '2023-10-13 12:40:10',
            file: '1753613045523-ÐÐ°ÐºÐ¾Ð¹ ÑÑ ÑÐµÐ³Ð¾Ð´Ð½Ñ ÐÐ°Ð³Ð¸Ðº.jpg',
        },
        {
            date: '2025-06-06 07:02:00',
            file: '1753613052324-Ð¸Ð¸.png',
        },
        {
            date: '2025-01-24 09:10:12',
            file: '1753613058668-Ð¸Ð³Ð¾ÑÑ.jpeg',
        },
        {
            date: '2024-09-09 16:40:35',
            file: '1753613063910-ÐÐ»Ð¾Ð¹ Ð¡Ð.jpg',
        },
        {
            date: '2025-01-13 05:43:19',
            file: '1753613074805-Ð·Ð°Ð¿ÑÐµÑÐ°Ñ ÑÐ¾Ð±Ð¸ÑÐ°ÑÑ.png',
        },
        {
            date: '2025-03-19 07:01:44',
            file: '1753613084981-Ð´ÑÐµÐ»Ñ.png',
        },
        {
            date: '2024-05-28 12:54:59',
            file: '1753613095243-Ð´Ð¾Ð±ÑÐ¾ÑÐ¸Ð» Ð³Ð¾Ð²Ð½Ð¾.jpg',
        },
        {
            date: '2025-01-29 05:25:00',
            file: '1753613120273-Ð´Ð¸Ð¼Ð¾Ð½.jpg',
        },
        {
            date: '2025-07-08 12:26:17',
            file: '1753613128439-Ð´ÐµÐ¶ÑÑÐ½ÑÐ¹.png',
        },
        {
            date: '2025-03-02 05:21:00',
            file: '1753613159626-ÐÐµÐ´Ð»Ð°Ð¹Ð½.jpg',
        },
        {
            date: '2025-04-28 07:56:00',
            file: '1753613214582-Ð´Ð°Ð½Ð¸Ð»-Ð¶Ð¸Ð².jpg',
        },
        {
            date: '2025-04-28 06:08:00',
            file: '1753613243903-Ð´Ð°Ð½Ð¸Ð»-Ð´Ð¸Ð¼Ð°.jpg',
        },
        {
            date: '2023-12-29 08:47:35',
            file: '1753613257207-ÐÐ°Ð¹ Ð³Ð°Ð»ÐºÑ.jpg',
        },
        {
            date: '2025-01-24 09:03:00',
            file: '1753613284262-ÐÐ¾Ð»ÑÐ±ÐµÐ² Ð¡Ð°Ð±Ð¸Ñ.jpg',
        },
        {
            date: '2024-09-13 09:25:46',
            file: '1753613292257-ÐÐµÐ¾ÑÐ³Ð¸Ð¹ Ð¸ ÐÐ³Ð¾Ñ.png',
        },
        {
            date: '2025-05-19 12:41:00',
            file: '1753613315281-Ð³Ð´Ðµ ÐºÐ°ÑÐ°Ð»Ð¾Ð³.jpg',
        },
        {
            date: '2025-03-07 08:32:19',
            file: '1753613322207-Ð³Ð´Ðµ Ð³Ð°Ð»ÐºÐ°.png',
        },
        {
            date: '2024-09-03 11:18:00',
            file: '1753613353108-Ð³Ð°Ð³Ð¸Ðº-ÑÐ°ÐºÑÐ¸ÑÑ.jpg',
        },
        {
            date: '2024-09-05 06:57:00',
            file: '1753613378442-ÐÐ°Ð³Ð¸Ðº-Ð¾Ð´Ð¾Ð±ÑÑÐµÑ-Ð±ÑÑÐ°.jpg',
        },
        {
            date: '2024-09-05 06:52:00',
            file: '1753613402599-ÐÐ°Ð³Ð¸Ðº-Ð³ÐµÑÐ±.jpg',
        },
        {
            date: '2022-02-09 13:42:00',
            file: '1753613424537-Ð³Ð°Ð³Ð¸Ðº.jpg',
        },
        {
            date: '2024-08-28 09:03:00',
            file: '1753613452965-Ð³Ð°Ð³Ð¸Ðº (3).jpg',
        },
        {
            date: '2025-02-03 12:07:49',
            file: '1753613458693-ÐÐ¾Ñ ÑÑÐ¾ Ð´Ð¾Ð±ÑÐ¾ÑÐºÐ°.png',
        },
        {
            date: '2025-01-28 16:02:14',
            file: '1753613466271-ÐÐµÐ· Ð¸Ð¼ÐµÐ½Ð¸-3.png',
        },
        {
            date: '2024-04-19 05:21:01',
            file: '1753613471549-Ð±Ð°Ð·Ð¾Ð²ÑÐ¹ ÐºÐ¾Ð¼Ð¿Ð¾Ð½ÐµÐ½Ñ.png',
        },
        {
            date: '2025-05-05 04:22:00',
            file: '1753613515250-ÐÐ½Ð¸Ð¼Ð°ÑÐ½Ð¸ÐºÐ¸.jpg',
        },
        {
            date: '2024-10-31 11:53:22',
            file: '1753613522690-wasted.png',
        },
        {
            date: '2023-10-11 08:45:48',
            file: '1753613529760-Untitled.png',
        },
        {
            date: '2025-03-21 05:53:31',
            file: '1753613537681-trojan-ÐÐ½ÑÐ¾Ð½.png',
        },
        {
            date: '2025-03-26 08:16:59',
            file: '1753613543638-thin-and-thick-book-meme-template.jpg',
        },
        {
            date: '2025-03-28 11:23:51',
            file: '1753613549253-tg_image_3655446252.jpeg',
        },
        {
            date: '2025-01-24 09:05:41',
            file: '1753613553865-tg_image_3309353275.jpeg',
        },
        {
            date: '2025-07-09 11:29:02',
            file: '1753613558697-Screenshot 2025-07-09 162837.png',
        },
        {
            date: '2024-07-29 08:23:28',
            file: '1753613563399-Screenshot 2024-07-29 132149.jpg',
        },
        {
            date: '2024-05-27 07:52:09',
            file: '1753613567635-Screenshot 2024-05-27 125204.jpg',
        },
        {
            date: '2024-05-27 07:51:47',
            file: '1753613572443-Screenshot 2024-05-27 125141.jpg',
        },
        {
            date: '2024-03-04 12:37:46',
            file: '1753613578394-Screenshot 2024-03-04 173740.png',
        },
        {
            date: '2024-11-05 11:27:47',
            file: '1753613583734-same energy.png',
        },
        {
            date: '2024-09-05 07:01:54',
            file: '1753613588762-sabytube.png',
        },
        {
            date: '2025-04-01 05:57:59',
            file: '1753613600217-regexp-god.jpg',
        },
        {
            date: '2025-07-23 07:36:56',
            file: '1753613606804-photo_2025-07-23_12-21-31.jpg',
        },
        {
            date: '2025-07-17 07:02:20',
            file: '1753613615946-photo_2025-07-17_12-01-02.jpg',
        },
        {
            date: '2025-05-23 10:09:12',
            file: '1753613621096-photo_2025-05-23_15-05-57.jpg',
        },
        {
            date: '2025-05-22 11:42:12',
            file: '1753613626375-photo_2025-05-22_16-30-41.jpg',
        },
        {
            date: '2025-04-28 08:32:39',
            file: '1753613632036-photo_2025-04-28_13-14-50.jpg',
        },
        {
            date: '2025-03-02 04:06:46',
            file: '1753613655798-photo_2025-03-02_09-06-46.jpg',
        },
        {
            date: '2025-02-21 10:25:31',
            file: '1753613662255-photo_2025-02-21_15-24-55.jpg',
        },
        {
            date: '2025-01-13 12:43:07',
            file: '1753613666871-photo_2025-01-13_17-42-51.jpg',
        },
        {
            date: '2025-01-13 07:37:11',
            file: '1753613670652-photo_2025-01-13_10-41-18.jpg',
        },
        {
            date: '2024-10-21 08:46:01',
            file: '1753613673991-photo_2024-10-14_22-32-05.jpg',
        },
        {
            date: '2024-09-03 09:06:32',
            file: '1753613677127-photo_2024-09-03_12-49-12.jpg',
        },
        {
            date: '2024-09-03 10:52:13',
            file: '1753613680539-photo_2024-09-02_08-47-25.jpg',
        },
        {
            date: '2024-08-28 08:59:39',
            file: '1753613685848-photo_2024-08-27_19-36-18.jpg',
        },
        {
            date: '2024-08-15 12:15:22',
            file: '1753613689480-photo_2024-08-15_17-14-49.jpg',
        },
        {
            date: '2024-08-01 08:35:28',
            file: '1753613693902-photo_2024-08-01_13-10-36.jpg',
        },
        {
            date: '2024-06-27 03:18:41',
            file: '1753613697638-photo_2024-06-27_08-18-38.jpg',
        },
        {
            date: '2024-06-05 08:14:51',
            file: '1753613701216-photo_2024-06-05_13-12-29.jpg',
        },
        {
            date: '2024-06-07 09:04:40',
            file: '1753613705246-photo_2024-06-05_13-12-27.jpg',
        },
        {
            date: '2024-05-27 08:03:53',
            file: '1753613708984-photo_2024-05-27_13-03-06.jpg',
        },
        {
            date: '2024-05-27 08:02:43',
            file: '1753613712787-photo_2024-05-27_13-02-19.jpg',
        },
        {
            date: '2024-05-13 13:06:59',
            file: '1753613716504-photo_2024-05-13_18-01-13.jpg',
        },
        {
            date: '2024-04-17 13:06:50',
            file: '1753613720532-photo_2024-04-17_18-04-41.jpg',
        },
        {
            date: '2024-03-15 06:46:32',
            file: '1753613723963-photo_2024-03-13_14-44-00.jpg',
        },
        {
            date: '2024-03-15 06:46:26',
            file: '1753613727603-photo_2024-03-11_12-59-55.jpg',
        },
        {
            date: '2024-02-27 08:18:29',
            file: '1753613732397-photo_2024-02-27_13-18-27.jpg',
        },
        {
            date: '2024-02-27 08:18:25',
            file: '1753613736001-photo_2024-02-27_13-18-15.jpg',
        },
        {
            date: '2024-02-27 08:17:13',
            file: '1753613739773-photo_2024-02-05_13-56-47.jpg',
        },
        {
            date: '2023-12-28 06:06:44',
            file: '1753613743889-photo_2023-12-17_15-42-10.jpg',
        },
        {
            date: '2023-12-14 10:02:20',
            file: '1753613751031-photo_2023-12-14_15-01-41.jpg',
        },
        {
            date: '2023-10-23 13:11:28',
            file: '1753613755164-photo_2023-10-23_17-39-11.jpg',
        },
        {
            date: '2023-10-23 13:11:24',
            file: '1753613758859-photo_2023-10-23_17-37-41.jpg',
        },
        {
            date: '2023-10-23 13:11:19',
            file: '1753613762541-photo_2023-10-23_17-37-32.jpg',
        },
        {
            date: '2023-10-16 07:00:46',
            file: '1753613765899-photo_2023-10-13_15-31-58.jpg',
        },
        {
            date: '2023-10-16 07:00:54',
            file: '1753613769445-photo_2023-10-13_15-27-39.jpg',
        },
        {
            date: '2023-10-13 09:37:36',
            file: '1753613772715-photo_2023-10-13_14-37-27.jpg',
        },
        {
            date: '2023-10-13 09:36:41',
            file: '1753613775868-photo_2023-10-13_14-36-40.jpg',
        },
        {
            date: '2023-10-13 12:40:17',
            file: '1753613779049-photo_2023-09-26_10-38-16.jpg',
        },
        {
            date: '2023-09-19 14:23:37',
            file: '1753613808422-photo_2023-09-19_23-25-37.jpg',
        },
        {
            date: '2023-03-23 09:32:14',
            file: '1753613812498-photo_2023-03-23_14-31-31.jpg',
        },
        {
            date: '2022-07-01 12:29:30',
            file: '1753613815680-photo_2022-07-01_17-26-14.jpg',
        },
        {
            date: '2022-05-04 08:23:01',
            file: '1753613818910-photo_2022-05-04_13-16-12.jpg',
        },
        {
            date: '2024-12-11 05:00:11',
            file: '1753613822077-photo_2021-07-05_19-10-05.jpg',
        },
        {
            date: '2024-08-28 09:08:14',
            file: '1753613825544-photo_2021-02-11_21-59-45.jpg',
        },
        {
            date: '2024-08-28 09:08:06',
            file: '1753613829730-photo_2021-02-11_16-01-07.jpg',
        },
        {
            date: '2024-04-17 13:14:34',
            file: '1753613836134-photo_2.jpg',
        },
        {
            date: '2025-03-03 08:46:00',
            file: '1753613855863-money.jpg',
        },
        {
            date: '2025-01-21 13:05:00',
            file: '1753613906643-metro_goldwyn_jordon.jpg',
        },
        {
            date: '2025-03-03 08:40:00',
            file: '1753613948668-man-in-black.jpg',
        },
        {
            date: '2020-09-13 02:24:32',
            file: '1753613974979-IMG 2020-09-13 07-24-32.jpg',
        },
        {
            date: '2025-06-27 06:06:47',
            file: '1753614000833-Image_2025-06-27_11-06-47_520.jpg',
        },
        {
            date: '2025-06-09 06:29:25',
            file: '1753614032851-image_2025-06-09_11-29-25.jpg',
        },
        {
            date: '2025-03-31 11:38:34',
            file: '1753614043846-Image_2025-03-31_16-37-44_939.png',
        },
        {
            date: '2025-01-29 17:22:36',
            file: '1753614067398-image_2025-01-29_22-28-36.jpg',
        },
        {
            date: '2024-03-12 06:47:01',
            file: '1753614076990-h2o.png',
        },
        {
            date: '2024-06-21 09:51:43',
            file: '1753614082996-gyCUT_D7cEA.jpg',
        },
        {
            date: '2025-03-27 13:03:00',
            file: '1753614102083-guru.jpg',
        },
        {
            date: '2025-06-06 06:57:19',
            file: '1753614109948-gpt.jpeg',
        },
        {
            date: '2025-05-21 06:34:00',
            file: '1753614129818-fury-orig.jpg',
        },
        {
            date: '2024-09-16 09:27:00',
            file: '1753614153137-fight_club.jpg',
        },
        {
            date: '2023-07-10 06:17:39',
            file: '1753614158790-fea4d97ae445dd8479c8c753b17522a6.jpg',
        },
        {
            date: '2023-11-07 13:47:50',
            file: '1753614163702-f132af38a3aa7dff4b6ae069f660ad05.jpg',
        },
        {
            date: '2024-04-02 07:10:53',
            file: '1753614171292-debug.png',
        },
        {
            date: '2024-04-16 11:53:44',
            file: '1753614179159-d659610f5b57264a84b18a792a23ece1.jpg',
        },
        {
            date: '2025-03-18 12:10:04',
            file: '1753614188965-chatgpt.png',
        },
        {
            date: '2023-10-18 09:43:49',
            file: '1753614193244-cd1332b61131e60e1eff1b932e3d4422.jpg',
        },
        {
            date: '2025-05-25 10:41:00',
            file: '1753614210423-a82b2945-dbff-4877-b0cd-0a1d9fee03fd.jpg',
        },
        {
            date: '2023-10-19 09:31:23',
            file: '1753614218905-0787d1cdb700b60d717df05ff4367135.jpg',
        },
        {
            date: '2023-10-16 11:13:47',
            file: '1753614226355-84dd9a59a86de3fed1f323bcd39f1503.jpg',
        },
        {
            date: '2024-11-06 10:36:43',
            file: '1753614231532-60 Ð¾ÑÐ¸Ð±Ð¾Ðº.jpg',
        },
        {
            date: '2025-03-03 08:39:00',
            file: '1753614249193-50cent.jpg',
        },
        {
            date: '2025-03-02 05:12:00',
            file: '1753614264782-15ds.jpg',
        },
        {
            date: '2025-05-19 12:17:00',
            file: '1753614287656-8dee550f-1c72-46e8-84f4-9eb2237ee1eb.jpg',
        },
        {
            date: '2025-05-21 07:58:00',
            file: '1753614302582-6ÑÑÐº.jpg',
        },
        {
            date: '2023-10-16 11:09:31',
            file: '1753614309625-6fd305cac44e19ccd77f92bfd2f370cd.jpg',
        },
        {
            date: '2024-12-12 06:14:41',
            file: '1753614315018-2 ÑÐ°ÑÐ° -30 Ð¼Ð¸Ð½ÑÑ.png',
        },
        {
            date: '2024-02-27 08:30:00',
            file: '1753614334403---.jpg',
        },
        {
            date: '2025-07-29 10:24:34',
            file: '1753784674145-ÐÐÐ¡.png',
        },
        {
            date: '2025-07-31 07:07:48',
            file: '1753945668053-ÐÐ°ÑÐ° Ð½ÑÐ¶ÐµÐ½.png',
        },
        {
            date: '2025-08-04 06:07:17',
            file: '1754287637049-ÐºÐ¾Ð½Ð²ÐµÑÑÐ°ÑÐ¸Ñ.jpeg',
        },
        {
            date: '2025-08-06 11:44:21',
            file: '1754480661047-photo_2025-08-06_16-34-38.jpg',
        },
        {
            date: '2025-08-07 07:30:12',
            file: '1754551812921-Ð¾ÑÐ¾ÑÐµÐ».jpg',
        },
        {
            date: '2025-08-07 12:51:22',
            file: '1754571082508-mozhet-hvatit-buhtet.jpg',
        },
        {
            date: '2025-07-21 11:12:25',
            file: '1756102495222-photo_2025-07-24_16-12-25.jpg',
        },
        {
            date: '2025-08-16 16:42:16',
            file: '1756105791187-photo_2025-08-16_21-43-16.jpg',
        },
        {
            date: '2025-08-27 09:10:36',
            file: '1756285836179-newbrowserLight.jpeg',
        },
        {
            date: '2025-08-29 06:32:14',
            file: '1756449134844-Screenshot 2025-08-29 113047.png',
        },
        {
            date: '2025-09-03 08:07:50',
            file: '1756886870182-photo_2025-09-03_13-06-36.jpg',
        },
        {
            date: '2025-09-03 08:47:06',
            file: '1756889226201-ÐÐ¾ Ð¿ÑÐ¸ÐºÐ¾Ð»Ñ.jpg',
        },
        {
            date: '2025-09-04 16:36:39',
            file: '1757003799064-photo_2025-09-04_21-34-22.jpg',
        },
        {
            date: '2025-09-09 05:31:46',
            file: '1757395906369-zeus.jpg',
        },
        {
            date: '2025-09-09 08:19:20',
            file: '1757405960035-photo_2025-09-09_13-12-58.jpg',
        },
        {
            date: '2025-09-10 09:15:44',
            file: '1757495744237-Ð´Ð»Ð¸ÑÐºÐ° Ð½Ð° ÑÐµÐ°ÐºÑ.png',
        },
        {
            date: '2025-09-10 12:48:16',
            file: '1757508496107-ÐÐ°ÑÐµÐ³Ð¾ÑÐ¸Ð¸ Ð¿ÐµÑÐµÐ¾ÑÐµÐ½ÐµÐ½Ñ.jpg',
        },
        {
            date: '2025-09-11 05:27:04',
            file: '1757568424272-eskobar-mem.jpg',
        },
        {
            date: '2025-09-16 14:34:10',
            file: '1758033250067-tg_image_3987812087.jpeg',
        },
        {
            date: '2025-09-11 07:20:16',
            file: '1758081660167-photo_2025-09-11_12-20-16.jpg',
        },
        {
            date: '2025-09-17 04:05:37',
            file: '1758081937736-Screenshot 2025-09-12 130356.jpg',
        },
        {
            date: '2025-09-17 06:29:11',
            file: '1758090551455-Ð¡Ð¾Ð¿Ð¾ÑÑÐ°Ð²Ð»ÐµÐ½Ð¸Ðµ.png',
        },
        {
            date: '2025-09-17 06:29:46',
            file: '1758090586220-ÑÐ¾Ð½ Ð¡Ð¾Ð¿Ð¾ÑÑÐ°Ð²Ð»ÐµÐ½Ð¸Ðµ.png',
        },
        {
            date: '2025-09-17 13:46:13',
            file: '1758116773825-og_og_1635698442217264325.jpg',
        },
        {
            date: '2025-09-23 13:11:56',
            file: '1758633116322-1706661481199822047.jpg',
        },
        {
            date: '2025-09-24 07:31:46',
            file: '1758699106121-56d7dd2s-960.jpg',
        },
        {
            date: '2025-09-26 05:24:26',
            file: '1758864266126-photo_2025-09-26_10-21-39.jpg',
        },
        {
            date: '2025-09-26 06:31:37',
            file: '1758868297231-Ð¸Ð½Ð´ÐµÐºÑÐ°ÑÐ¸Ñ.jpeg',
        },
        {
            date: '2025-09-26 06:59:33',
            file: '1758869973975-Ð¿Ð»Ð°ÑÑÐ¾ÑÐ¼Ð°-ÑÐ¼Ð¾ÑÑÐ¸Ñ-ÑÐ¿Ð¸ÑÐºÐ¸.jpg',
        },
        {
            date: '2025-09-26 12:34:59',
            file: '1758890099982-Screenshot 2025-09-26 173415.png',
        },
        {
            date: '2025-09-29 11:50:36',
            file: '1759146636036-ÑÐµÐ²ÑÑ.jpg',
        },
        {
            date: '2025-09-30 06:25:05',
            file: '1759213505827-ÐÐ»ÑÑ ÐºÐ¾Ð´Ñ.jpg',
        },
        {
            date: '2025-09-24 11:37:02',
            file: '1759213612949-Image_2025-09-24_17-37-02_850.png',
        },
        {
            date: '2025-10-01 07:31:32',
            file: '1759303892456-photo_2025-10-01_12-29-16.jpg',
        },
        {
            date: '2025-09-30 14:07:07',
            file: '1759304083576-photo_2025-09-30_19-07-07.jpg',
        },
        {
            date: '2025-10-01 07:41:51',
            file: '1759304511675-Ð Ð¸ÑÑÐ½Ð¾Ðº1.png',
        },
        {
            date: '2025-10-01 07:43:14',
            file: '1759304594087-Ð Ð¸ÑÑÐ½Ð¾Ðº2.png',
        },
        {
            date: '2025-10-02 06:08:49',
            file: '1759385329045-Ð²ÑÐµÐ¼Ñ Ð²ÐµÑÐ½ÑÑÑ Ð½Ð¾Ð²ÑÐ¹ ÑÐ¾ÑÐ¼Ð°Ñ.jpg',
        },
        {
            date: '2025-10-02 06:17:42',
            file: '1759385862168-Ð·ÐµÑÐºÐ°Ð»Ð¾.jpg',
        },
        {
            date: '2025-10-02 06:23:29',
            file: '1759386209777-Screenshot 2025-10-02 112113.jpg',
        },
        {
            date: '2025-10-02 13:24:45',
            file: '1759411485930-Screenshot 2025-10-02 182236.png',
        },
        {
            date: '2025-10-02 13:37:39',
            file: '1759412259410-ÑÐ°ÑÐ°Ð³Ð¾ÑÐµÑ.png',
        },
        {
            date: '2025-10-02 13:38:57',
            file: '1759412337353-b610a049-7faf-4757-9637-3c5951c15113.png',
        },
        {
            date: '2025-10-03 07:28:48',
            file: '1759476528358-pasted-image.png',
        },
        {
            date: '2025-10-03 09:04:39',
            file: '1759482279074-IMG_20251003_140304_264.png',
        },
        {
            date: '2025-10-05 05:15:43',
            file: '1759641343586-photo_2025-10-05_09-16-56.jpg',
        },
        {
            date: '2025-10-06 04:58:27',
            file: '1759726707513-Ð¾Ð¿ÑÐ¸Ð¼ÑÑ Ð¿ÑÐ°Ð¸ÌÐ¼.jpg',
        },
        {
            date: '2025-10-06 07:31:21',
            file: '1759735881461-pasted-image.png',
        },
        {
            date: '2025-10-06 13:05:07',
            file: '1759755907392-Screenshot 2025-10-06 180201.jpg',
        },
        {
            date: '2025-10-08 06:01:45',
            file: '1759903305445-ÐÐ¸Ð¼Ð° ÑÐµÐºÐ¾Ð¼ÐµÐ½Ð´ÑÐµÑ.jpg',
        },
        {
            date: '2025-10-08 09:54:22',
            file: '1759917262638-Ð´Ð¾Ð³Ð¾Ð²Ð¾Ñ.jpg',
        },
        {
            date: '2025-10-09 07:27:46',
            file: '1759994866355-pasted-image.png',
        },
        {
            date: '2025-10-09 11:34:33',
            file: '1760009673956-pasted-image.png',
        },
        {
            date: '2025-10-09 14:56:10',
            file: '1760021770453-pasted-image.jpg',
        },
        {
            date: '2025-10-09 16:43:05',
            file: '1760028185164-pasted-image.png',
        },
        {
            date: '2025-10-10 06:09:17',
            file: '1760076557411-pasted-image.png',
        },
        {
            date: '2025-10-10 12:38:39',
            file: '1760099919103-pasted-image.png',
        },
        {
            date: '2025-10-10 13:00:09',
            file: '1760101209965-pasted-image.png',
        },
    ];
}

// @ts-ignore
function getLocalData() {
    return [
        { date: '2025-07-27 16:05:24', file: '--.jpg' },
        {
            date: '2023-10-19 14:31:23',
            file: '0787d1cdb700b60d717df05ff4367135.jpg',
        },
        { date: '2025-07-27 16:04:17', file: '15ds.jpg' },
        { date: '2025-09-23 18:10:43', file: '1706661481199822047.jpg' },
        { date: '2024-12-12 11:14:41', file: '2 часа -30 минут.png' },
        {
            date: '2025-09-26 11:46:01',
            file: '2c35baf4-7c7d-46ee-aa61-9973154d1b92.jfif',
        },
        { date: '2025-07-27 16:03:59', file: '50cent.jpg' },
        { date: '2024-11-06 15:36:43', file: '60 ошибок.jpg' },
        {
            date: '2023-10-16 16:09:31',
            file: '6fd305cac44e19ccd77f92bfd2f370cd.jpg',
        },
        { date: '2025-07-27 16:04:54', file: '6рук.jpg' },
        {
            date: '2023-10-16 16:13:47',
            file: '84dd9a59a86de3fed1f323bcd39f1503.jpg',
        },
        {
            date: '2025-07-27 16:04:38',
            file: '8dee550f-1c72-46e8-84f4-9eb2237ee1eb.jpg',
        },
        {
            date: '2025-07-27 16:03:21',
            file: 'a82b2945-dbff-4877-b0cd-0a1d9fee03fd.jpg',
        },
        {
            date: '2025-01-14 12:44:36',
            file: 'b610a049-7faf-4757-9637-3c5951c15113.png',
        },
        {
            date: '2025-09-03 09:16:47',
            file: 'c9202732-0f2a-4f8e-92d7-04308df07c75.jfif',
        },
        {
            date: '2023-10-18 14:43:49',
            file: 'cd1332b61131e60e1eff1b932e3d4422.jpg',
        },
        { date: '2025-03-18 17:10:04', file: 'chatgpt.png' },
        {
            date: '2024-04-16 16:53:44',
            file: 'd659610f5b57264a84b18a792a23ece1.jpg',
        },
        { date: '2024-04-02 12:10:53', file: 'debug.png' },
        { date: '2025-09-11 10:24:47', file: 'eskobar-mem.jpg' },
        {
            date: '2023-11-07 18:47:50',
            file: 'f132af38a3aa7dff4b6ae069f660ad05.jpg',
        },
        {
            date: '2023-07-10 11:17:39',
            file: 'fea4d97ae445dd8479c8c753b17522a6.jpg',
        },
        { date: '2025-07-27 16:02:24', file: 'fight_club.jpg' },
        { date: '2025-07-27 16:01:59', file: 'fury-orig.jpg' },
        { date: '2025-06-06 11:57:19', file: 'gpt.jpeg' },
        { date: '2025-07-27 16:01:30', file: 'guru.jpg' },
        { date: '2024-06-21 14:51:43', file: 'gyCUT_D7cEA.jpg' },
        { date: '2024-03-12 11:47:01', file: 'h2o.png' },
        { date: '2025-07-27 16:00:57', file: 'image_2025-01-29_22-28-36.jpg' },
        {
            date: '2025-03-31 16:38:34',
            file: 'Image_2025-03-31_16-37-44_939.png',
        },
        { date: '2025-07-27 16:00:16', file: 'image_2025-06-09_11-29-25.jpg' },
        {
            date: '2025-07-27 15:59:45',
            file: 'Image_2025-06-27_11-06-47_520.jpg',
        },
        {
            date: '2025-09-24 19:01:53',
            file: 'Image_2025-09-24_17-37-02_850.png',
        },
        { date: '2025-07-27 15:59:23', file: 'IMG 2020-09-13 07-24-32.jpg' },
        { date: '2025-07-27 15:58:50', file: 'man-in-black.jpg' },
        { date: '2025-10-14 00:20:07', file: 'meta.log' },
        { date: '2025-07-27 15:58:09', file: 'metro_goldwyn_jordon.jpg' },
        { date: '2025-07-27 15:57:23', file: 'money.jpg' },
        { date: '2025-08-27 14:09:29', file: 'newbrowserLight.jpeg' },
        { date: '2025-09-17 18:44:35', file: 'og_og_1635698442217264325.jpg' },
        { date: '2024-04-17 18:14:34', file: 'photo_2.jpg' },
        { date: '2024-08-28 14:08:06', file: 'photo_2021-02-11_16-01-07.jpg' },
        { date: '2024-08-28 14:08:14', file: 'photo_2021-02-11_21-59-45.jpg' },
        { date: '2024-12-11 10:00:11', file: 'photo_2021-07-05_19-10-05.jpg' },
        { date: '2022-05-04 13:23:01', file: 'photo_2022-05-04_13-16-12.jpg' },
        { date: '2022-07-01 17:29:30', file: 'photo_2022-07-01_17-26-14.jpg' },
        { date: '2023-03-23 14:32:14', file: 'photo_2023-03-23_14-31-31.jpg' },
        { date: '2025-07-27 15:56:31', file: 'photo_2023-09-19_23-25-37.jpg' },
        { date: '2023-10-13 17:40:17', file: 'photo_2023-09-26_10-38-16.jpg' },
        { date: '2023-10-13 14:36:41', file: 'photo_2023-10-13_14-36-40.jpg' },
        { date: '2023-10-13 14:37:36', file: 'photo_2023-10-13_14-37-27.jpg' },
        { date: '2023-10-16 12:00:54', file: 'photo_2023-10-13_15-27-39.jpg' },
        { date: '2023-10-16 12:00:46', file: 'photo_2023-10-13_15-31-58.jpg' },
        { date: '2023-10-23 18:11:19', file: 'photo_2023-10-23_17-37-32.jpg' },
        { date: '2023-10-23 18:11:24', file: 'photo_2023-10-23_17-37-41.jpg' },
        { date: '2023-10-23 18:11:28', file: 'photo_2023-10-23_17-39-11.jpg' },
        { date: '2023-12-14 15:02:20', file: 'photo_2023-12-14_15-01-41.jpg' },
        { date: '2023-12-28 11:06:44', file: 'photo_2023-12-17_15-42-10.jpg' },
        { date: '2024-02-27 13:17:13', file: 'photo_2024-02-05_13-56-47.jpg' },
        { date: '2024-02-27 13:18:25', file: 'photo_2024-02-27_13-18-15.jpg' },
        { date: '2024-02-27 13:18:29', file: 'photo_2024-02-27_13-18-27.jpg' },
        { date: '2024-03-15 11:46:26', file: 'photo_2024-03-11_12-59-55.jpg' },
        { date: '2024-03-15 11:46:32', file: 'photo_2024-03-13_14-44-00.jpg' },
        { date: '2024-04-17 18:06:50', file: 'photo_2024-04-17_18-04-41.jpg' },
        { date: '2024-05-13 18:06:59', file: 'photo_2024-05-13_18-01-13.jpg' },
        { date: '2024-05-27 13:02:43', file: 'photo_2024-05-27_13-02-19.jpg' },
        { date: '2024-05-27 13:03:53', file: 'photo_2024-05-27_13-03-06.jpg' },
        { date: '2024-06-07 14:04:40', file: 'photo_2024-06-05_13-12-27.jpg' },
        { date: '2024-06-05 13:14:51', file: 'photo_2024-06-05_13-12-29.jpg' },
        { date: '2024-06-27 08:18:41', file: 'photo_2024-06-27_08-18-38.jpg' },
        { date: '2024-08-01 13:35:28', file: 'photo_2024-08-01_13-10-36.jpg' },
        { date: '2024-08-15 17:15:22', file: 'photo_2024-08-15_17-14-49.jpg' },
        { date: '2024-08-28 13:59:39', file: 'photo_2024-08-27_19-36-18.jpg' },
        { date: '2024-09-03 15:52:13', file: 'photo_2024-09-02_08-47-25.jpg' },
        { date: '2024-09-03 14:06:32', file: 'photo_2024-09-03_12-49-12.jpg' },
        { date: '2024-10-21 13:46:01', file: 'photo_2024-10-14_22-32-05.jpg' },
        { date: '2025-01-13 12:37:11', file: 'photo_2025-01-13_10-41-18.jpg' },
        { date: '2025-01-13 17:43:07', file: 'photo_2025-01-13_17-42-51.jpg' },
        { date: '2025-02-21 15:25:31', file: 'photo_2025-02-21_15-24-55.jpg' },
        { date: '2025-07-27 15:54:03', file: 'photo_2025-03-02_09-06-46.jpg' },
        { date: '2025-04-28 13:32:39', file: 'photo_2025-04-28_13-14-50.jpg' },
        { date: '2025-05-22 16:42:12', file: 'photo_2025-05-22_16-30-41.jpg' },
        { date: '2025-05-23 15:09:12', file: 'photo_2025-05-23_15-05-57.jpg' },
        { date: '2025-07-17 12:02:20', file: 'photo_2025-07-17_12-01-02.jpg' },
        { date: '2025-07-23 12:36:56', file: 'photo_2025-07-23_12-21-31.jpg' },
        { date: '2025-08-25 11:14:46', file: 'photo_2025-07-24_16-12-25.jpg' },
        { date: '2025-08-06 16:43:37', file: 'photo_2025-08-06_16-34-38.jpg' },
        { date: '2025-08-07 16:49:02', file: 'photo_2025-08-07_16-41-36.jpg' },
        { date: '2025-08-25 12:09:37', file: 'photo_2025-08-16_21-43-16.jpg' },
        { date: '2025-08-25 11:47:50', file: 'photo_2025-08-16_21-43-16.png' },
        { date: '2025-09-03 13:06:49', file: 'photo_2025-09-03_13-06-36.jpg' },
        { date: '2025-09-04 21:35:50', file: 'photo_2025-09-04_21-34-22.jpg' },
        { date: '2025-09-09 13:13:21', file: 'photo_2025-09-09_13-12-58.jpg' },
        { date: '2025-09-11 12:21:26', file: 'photo_2025-09-11_12-20-16.jpg' },
        { date: '2025-09-26 10:22:59', file: 'photo_2025-09-26_10-21-39.jpg' },
        { date: '2025-10-01 12:34:32', file: 'photo_2025-09-30_19-07-07.jpg' },
        { date: '2025-10-01 12:30:47', file: 'photo_2025-10-01_12-29-16.jpg' },
        { date: '2025-10-05 10:13:33', file: 'photo_2025-10-05_09-16-56.jpg' },
        { date: '2025-04-01 10:57:59', file: 'regexp-god.jpg' },
        { date: '2022-05-31 17:07:07', file: 'review.psd' },
        { date: '2024-09-05 12:01:54', file: 'sabytube.png' },
        { date: '2024-11-05 16:27:47', file: 'same energy.png' },
        { date: '2025-07-13 08:09:24', file: 'screen/' },
        {
            date: '2024-03-04 17:37:46',
            file: 'Screenshot 2024-03-04 173740.png',
        },
        {
            date: '2024-05-27 12:51:47',
            file: 'Screenshot 2024-05-27 125141.jpg',
        },
        {
            date: '2024-05-27 12:52:09',
            file: 'Screenshot 2024-05-27 125204.jpg',
        },
        {
            date: '2024-07-29 13:23:28',
            file: 'Screenshot 2024-07-29 132149.jpg',
        },
        {
            date: '2025-07-09 16:29:02',
            file: 'Screenshot 2025-07-09 162837.png',
        },
        {
            date: '2025-08-29 11:31:03',
            file: 'Screenshot 2025-08-29 113047.png',
        },
        {
            date: '2025-09-17 09:05:23',
            file: 'Screenshot 2025-09-12 130356.jpg',
        },
        {
            date: '2025-09-26 17:34:28',
            file: 'Screenshot 2025-09-26 173415.png',
        },
        {
            date: '2025-10-02 11:21:57',
            file: 'Screenshot 2025-10-02 112113.png',
        },
        {
            date: '2025-10-02 18:24:28',
            file: 'Screenshot 2025-10-02 182236.png',
        },
        {
            date: '2025-10-06 18:04:53',
            file: 'Screenshot 2025-10-06 180201.jpg',
        },
        { date: '2025-01-24 14:05:41', file: 'tg_image_3309353275.jpeg' },
        { date: '2025-03-28 16:23:51', file: 'tg_image_3655446252.jpeg' },
        { date: '2025-09-16 13:06:54', file: 'tg_image_3987812087.jpeg' },
        {
            date: '2025-03-26 13:16:59',
            file: 'thin-and-thick-book-meme-template.jpg',
        },
        { date: '2025-03-21 10:53:31', file: 'trojan-Антон.png' },
        { date: '2023-10-11 13:45:48', file: 'Untitled.png' },
        { date: '2025-05-02 11:32:48', file: 'Video/' },
        { date: '2024-10-31 16:53:22', file: 'wasted.png' },
        { date: '2025-09-09 10:30:18', file: 'zeus.jpg' },
        { date: '2025-07-27 15:51:48', file: 'Анимашники.jpg' },
        { date: '2024-10-31 21:28:29', file: 'А-что-если.gif' },
        { date: '2025-10-02 11:20:41', file: 'База/' },
        { date: '2024-04-19 10:21:01', file: 'базовый компонент.png' },
        { date: '2025-01-28 21:02:14', file: 'Без имени-3.png' },
        { date: '2025-07-03 09:37:08', file: 'Виталий/' },
        { date: '2025-07-29 15:23:14', file: 'ВОС.png' },
        { date: '2025-02-03 17:07:49', file: 'Вот это доброска.png' },
        { date: '2025-10-02 11:07:45', file: 'время вернуть новый формат.jpg' },
        { date: '2025-07-27 15:50:34', file: 'гагик (3).jpg' },
        { date: '2025-07-27 15:50:13', file: 'гагик.jpg' },
        { date: '2025-07-27 15:49:52', file: 'Гагик-герб.jpg' },
        { date: '2025-07-27 15:49:23', file: 'Гагик-одобряет-бута.jpg' },
        { date: '2025-07-27 15:48:57', file: 'гагик-таксист.jpg' },
        { date: '2025-03-07 13:32:19', file: 'где галка.png' },
        { date: '2025-07-27 15:48:21', file: 'где каталог.jpg' },
        { date: '2024-09-13 14:25:46', file: 'Георгий и Егор.png' },
        { date: '2025-07-27 15:47:52', file: 'Голубев Сабит.jpg' },
        { date: '2023-12-29 13:47:35', file: 'Дай галку.jpg' },
        { date: '2025-07-27 15:46:22', file: 'данил-дима.jpg' },
        { date: '2025-07-27 15:46:09', file: 'данил-жив.jpg' },
        { date: '2025-07-27 15:45:42', file: 'Дедлайн.jpg' },
        { date: '2025-07-08 17:26:17', file: 'дежурный.png' },
        { date: '2025-05-02 11:32:52', file: 'Дима завис/' },
        { date: '2025-10-08 11:00:33', file: 'Дима рекомендует.jpg' },
        { date: '2025-07-27 15:45:08', file: 'димон.jpg' },
        { date: '2025-09-10 13:55:44', file: 'длитка на реакт.png' },
        { date: '2024-05-28 17:54:59', file: 'добросил говно.jpg' },
        { date: '2025-03-19 12:01:44', file: 'дуель.png' },
        { date: '2025-01-13 10:43:19', file: 'запрещаю собирать.png' },
        { date: '2025-10-02 11:16:55', file: 'зеркало.jpg' },
        { date: '2024-09-09 21:40:35', file: 'Злой СВ.jpg' },
        { date: '2025-01-24 14:10:12', file: 'игорь.jpeg' },
        { date: '2025-06-06 12:02:00', file: 'ии.png' },
        { date: '2025-09-30 11:23:17', file: 'Илья коды.jpg' },
        { date: '2025-09-26 11:30:14', file: 'индексация.jpeg' },
        { date: '2023-10-13 17:40:10', file: 'Какой ты сегодня Гагик.jpg' },
        { date: '2023-10-13 14:50:44', file: 'Катадлг этот ебучий.jpg' },
        { date: '2025-01-10 12:34:38', file: 'каталог.jpg' },
        { date: '2025-09-10 17:47:21', file: 'Категории переоценены.jpg' },
        { date: '2024-10-10 13:47:25', file: 'кнопка.jpg' },
        { date: '2024-04-16 16:40:09', file: 'конвертация.png' },
        { date: '2025-07-27 15:43:14', file: 'копатель.jpg' },
        { date: '2025-05-05 14:13:59', file: 'кот-димона.png' },
        { date: '2025-07-27 15:42:40', file: 'крестоносец-кубаноид.jpg' },
        { date: '2023-10-13 14:50:23', file: 'кто хочет стать.jpg' },
        { date: '2025-01-30 11:22:35', file: 'легенда.png' },
        { date: '2024-08-27 13:29:11', file: 'лучший БЛщик.png' },
        { date: '2024-02-27 13:33:04', file: 'Мамбетов Сергей.jpg' },
        { date: '2025-01-31 10:43:18', file: 'мемо.png' },
        { date: '2024-10-29 14:51:40', file: 'Моё_время_пришло.jpg' },
        { date: '2024-12-25 17:13:31', file: 'нарушаем.jpg' },
        { date: '2024-12-25 18:03:22', file: 'Нафис и Фанис.png' },
        { date: '2025-05-21 18:06:29', file: 'Не помещаюсь.png' },
        { date: '2024-10-08 16:39:04', file: 'ну же запускайся.png' },
        { date: '2024-11-05 12:24:42', file: 'обещал уволится.jpg' },
        { date: '2024-12-09 12:39:08', file: 'Обсуждаем.jpg' },
        { date: '2024-07-25 12:55:20', file: 'онлайн и звонки.png' },
        { date: '2024-07-25 13:36:45', file: 'оптимизация каталога.png' },
        { date: '2025-08-07 12:29:54', file: 'отошел.jpg' },
        { date: '2025-07-31 12:07:08', file: 'Паша нужен.png' },
        { date: '2025-05-30 12:36:01', file: 'перетосовал.png' },
        { date: '2024-09-26 16:54:25', file: 'Петр.jpg' },
        { date: '2025-01-24 12:04:41', file: 'петр.png' },
        { date: '2025-07-27 15:39:34', file: 'Планета обезьян.jpg' },
        { date: '2025-09-26 11:58:01', file: 'платформа-смотрит-списки.jpg' },
        { date: '2025-09-03 13:46:06', file: 'По приколу.jpg' },
        { date: '2025-03-14 12:47:13', file: 'поймай меня если сможешь.png' },
        { date: '2025-01-15 13:02:41', file: 'полукарточка.png' },
        { date: '2024-04-08 15:46:39', file: 'понедельник.png' },
        { date: '2023-10-13 14:50:33', file: 'пора.jpg' },
        { date: '2025-01-10 15:18:10', file: 'Проиграл.jpg' },
        { date: '2024-10-29 10:42:48', file: 'Пророк.png' },
        { date: '2025-07-27 13:56:04', file: 'Пятакв.png' },
        { date: '2024-12-11 09:20:42', file: 'Пятаков, работай.jpeg' },
        { date: '2025-03-24 15:22:44', file: 'разебал машину 2x.jpg' },
        { date: '2025-05-16 16:49:05', file: 'Разобрал 7100.png' },
        { date: '2025-05-02 11:32:53', file: 'расписание/' },
        { date: '2025-07-27 15:37:54', file: 'ревю-марзость.jpg' },
        { date: '2025-07-17 13:26:20', file: 'рекурия vs конверация.jpg' },
        { date: '2024-10-21 15:29:12', file: 'Рекурсия.png' },
        { date: '2025-10-01 12:41:28', file: 'Рисунок1.png' },
        { date: '2025-10-01 12:42:52', file: 'Рисунок2.png' },
        { date: '2024-09-30 10:50:21', file: 'Роганов.jpg' },
        { date: '2025-05-16 10:44:44', file: 'рэкитир.png' },
        { date: '2025-02-05 18:18:38', file: 'Сабит в темноте.png' },
        { date: '2025-01-14 18:15:05', file: 'Сабит и ЕГАИС.png' },
        { date: '2025-05-07 15:39:05', file: 'СабитГуд.png' },
        { date: '2025-05-13 12:50:06', file: 'СабитГуд2.jpg' },
        { date: '2025-07-27 15:36:01', file: 'СВ_одобряет.jpg' },
        { date: '2023-10-13 14:31:06', file: 'Свой Бут.jpg' },
        { date: '2025-04-04 14:45:48', file: 'Следствие.mp4' },
        { date: '2025-01-13 18:19:11', file: 'Слив.gif' },
        { date: '2025-07-27 15:35:02', file: 'слив.jpg' },
        { date: '2024-05-27 13:07:00', file: 'сломал каталог.jpg' },
        { date: '2025-01-14 18:27:13', file: 'Соглашение.png' },
        {
            date: '2024-02-13 17:43:59',
            file: 'Сопоставление Алена в маске.jpg',
        },
        { date: '2024-02-13 17:44:05', file: 'Сопоставление Алена.jpg' },
        { date: '2025-09-17 11:26:25', file: 'Сопоставление.png' },
        { date: '2024-11-05 12:59:31', file: 'супервиджет.jpg' },
        { date: '2025-04-01 16:15:00', file: 'таины человечества.png' },
        { date: '2025-03-05 14:44:20', file: 'тарагорец.png' },
        { date: '2024-11-28 09:43:47', file: 'тестируем.jpg' },
        { date: '2025-05-19 16:43:17', file: 'техрук.png' },
        { date: '2025-01-10 09:44:15', file: 'Тролит.jpg' },
        { date: '2024-09-09 10:47:37', file: 'у нас так не принято.png' },
        { date: '2025-07-27 15:32:34', file: 'устал.jpg' },
        { date: '2024-10-30 16:35:16', file: 'участок.jpg' },
        { date: '2024-09-09 12:34:02', file: 'Участокpng.png' },
        { date: '2023-10-13 14:36:37', file: 'учись когда я жив.jpg' },
        { date: '2025-01-13 12:32:10', file: 'философ.png' },
        { date: '2025-09-17 11:26:42', file: 'фон Сопоставление.png' },
        { date: '2024-10-07 16:36:22', file: 'хватит.jpg' },
        { date: '2025-03-25 17:38:15', file: 'человек конвертация.png' },
        { date: '2025-10-02 18:39:41', file: 'черновик/' },
        { date: '2025-07-27 15:30:13', file: 'что по задаче.jpg' },
        { date: '2024-10-23 12:47:30', file: 'что такое каталог.png' },
        { date: '2025-07-27 13:40:33', file: 'ШабАрОв.jpg' },
        { date: '2025-10-08 10:47:05', file: 'шаблоны/' },
        { date: '2024-08-29 12:14:37', file: 'Щедрин.png' },
        { date: '2024-10-21 13:46:13', file: 'Я и есть список.jpg' },
    ];
}
